ext_alsav/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/CommonModules/ФормированиеПечатныхФорм/Ext/Module.bsl
&Вместо("СоответствиеСтавокИСуммНДС")
Функция алсав_СоответствиеСтавокИСуммНДС()
	// Вставить содержимое метода.
	СоответствиеСтавокНДС = ПродолжитьВызов();
	
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС5,      0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС5_105,      0);
	
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС7,      0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС7_107,      0);
	
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС22,      0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС22_122,      0);
	
	Возврат СоответствиеСтавокНДС;
КонецФункции
